app/views/users/show.html.slim


- @user.quits.each do |quit|
---
SELECT "quits".* FROM "quits"  WHERE "quits"."user_id" = ?  [["user_id", 1]]