app/views/books/_book.html.erb

    <span>
      <% book.genres.each do |genre| %>
---
SELECT "book_genres".* FROM "book_genres"  WHERE "book_genres"."book_id" IN (1, 2, 3, 4)
SELECT "genres".* FROM "genres" INNER JOIN "book_genres" ON "genres"."id" = "book_genres"."genre_id" WHERE "book_genres"."book_id" = ?  [["book_id", 5]]