app/controllers/follows_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "follows" ("created_at", "followed_id", "updated_at") VALUES (?, ?, ?)  [["created_at", "2015-04-25 04:03:05.445078"], ["followed_id", 1], ["updated_at", "2015-04-25 04:03:05.445078"]]
---
    def create
        followed = User.find(params[:user_id])
        follower = current_user
        Follow.create(follower: follower, followed: followed)

SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "follows".* FROM "follows"  WHERE "follows"."followed_id" = 1
DELETE FROM "follows" WHERE "follows"."id" = 1
---
    def destroy
        followed = User.find(params[:user_id])
        follower = current_user
        if follower == nil
            follow = Follow.where(followed_id: followed.id)
        else
            follow = Follow.where(followed_id: followed.id, follower_id: follower.id)
        end
        Follow.delete(follow)