app/controllers/users_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "follows".* FROM "follows"  WHERE "follows"."followed_id" = 1 AND "follows"."follower_id" IS NULL  ORDER BY "follows"."id" ASC LIMIT 1
---
  def show
    @user = User.find params[:id]
    @follow = Follow.where(followed: @user, follower: current_user).first